[
  { "name": "Hero", "description": "Born into unusual circumstances, takes on an adventure and faces many obstacles.  Has the help of special weapons, the supernatural, a mentor/guide, and/or companions.  Must prove him/herself many times, but is rewarded in the end.", "typical_traits": [ "Honest", "Brave", "Humble", "Selfless", "Doubtful", "Kind", "Leader", "Unrelenting", "Determined", "Focused" ] },
  { "name": "Tragic Hero", "description": "A hero with a fatal flaw that leads to seemingly undeserved downfall.  At first too prideful, but learns from mistake that leads to devastating consequences.", "typical_traits": [ "Prideful", "Intelligent", "Flawed", "Doomed", "Noble"] },
  { "name": "Romantic Hero", "description": "Rejects the established norms and conventions, also rejected by society.  Can be more centered around though and emotion than action.  May also have a love interest even while in exile.", "typical_traits": ["Alienated", "Lonely", "Emotional", "Intuitive", "Regretful", "Brave", "Attractive", "Rebellious"] },
  { "name": "Byronic Hero", "description": "Typically rebellious, arrogant, anti-social or in exile, and darkly, enticingly romantic.  More extreme version of Romantic Hero.  Also known as an Antihero.", "typical_traits": ["Arrogant", "Cynical", "Passionate", "Attractive", "Unethical", "Brooding", "Self-Destructive", "Jaded", "Cunning", "Manipulative", "Ruthless", "Rebellious", "Angry", "Doubtful"] },
  { "name": "Mentor", "description": "Provides the hero with guidance, training, support (moral or phyiscal), or motivation.  Can also have experienced a crisis in the past (fallen mentor), leading them to become a mentor.  They may also have been a hero in the past.  May look unkempt or old.", "typical_traits": [ "Intelligent", "Empathetic", "Dishevelled", "Older", "Unreliable", "Famous", "Trustworthy"] },
  { "name": "The Fool", "description": "Provides comic relief for the reader and the other characters.  Can sometimes make dangerous mistakes, but is usually harmless even if working for the antagonist.", "typical_traits": ["Stupid", "Funny", "Timid", "Good-natured"] },
  { "name": "Caregiver", "description": "Is the source of comfort and nurture for the hero, though overly protective at first. ", "typical_traits": ["Dutiful", "Caring", "Loving", "Protective", "Responsible", "Guiding", "Nurturing"] },
  { "name": "Love Interest", "description": "Shares a bond of dedication and love with the hero, and is possibly the one who believes in the ideals of the hero most.  Sometimes, may not return the affection given by the hero.", "typical_traits": [ "Emotional", "Jealous", "Loving", "Caring", "Affectionate"] },
  { "name": "Sidekick", "description": "Allied with either the Hero or the Antagonist.  Can be a wingman.  Shares a deep trust with the hero, or a shaky trust with the antagonist.  Usually has something about their background that makes them stick out from the crowd.", "typical_traits": ["Empathetic", "Unintelligent", "Loyal", "Trustworthy", "Timid"] },
  { "name": "Antagonist", "description": "Directly opposed to the main hero.  Does everything possible to cause the hero to fail; however, may share many similarities with the hero.  Can have a wide array of possible traits.", "typical_traits": ["Cunning", "Maniacal", "Vengeful", "Ruthless", "Deceptive", "Unethical"] },
  { "name": "Contagonist", "description": "Seeks to deflect the hero or delay the hero's progress towards the goal.  May be allied with either the Hero or the Antagonist.  Can be a bad influence, representative of temptation, opposed to the hero, or just an annoyance.", "typical_traits": ["Deceptive", "Manipulative"] },
  { "name": "Magician", "description": "Produces unexplainable products or events, which may strike fear in some. Also known as a shaman.", "typical_traits": ["Wise", "Spiritual", "Lonely", "Eccentric", "Powerful"] },
  { "name": "Scapegoat", "description": "Receives blame for actions and suffers for the flaws of others.  Sometimes sacrificed for the greater good.", "typical_traits": ["Unlucky", "Innocent", "Timid"] },
  { "name": "Alien", "description": "Does not share the same language or cultures as most of the main characters, though the alien can evolve over the story to remedy this.", "typical_traits": ["Humorless", "Detatched", "Intelligent", "Helpful", "Annoying", "Arrogant", "Serious"] },
  { "name": "The Divine", "description": "Usually not of the same species as the hero and is part of the supernatural.  Serves as a more powerful mentor or caregiver to the hero, though may also work against the hero if there is an opposing supernatural being.", "typical_traits": ["Immortal", "Helpful", "All-knowing", "Rulebreaking"] },
  { "name": "Artificial Intelligence", "description": "Can sometimes the serve the same purpose as the fool (comedic relief), but can also be a more instrumental tool in helping the hero or antagonist.  Can be intelligent at specific tasks, or fully intelligent and aware.", "typical_traits": ["Robotic", "Intelligent", "Helpful", "Serious", "Entertaining"] }
]
